<?php

$lang['required']			= "Энэ %s талбарыг бөглөх шаардлагатай.";
$lang['isset']				= "Энэ %s талбарт хэмжээ хэрэгтэй.";
$lang['valid_email']		        = "Энэ %s талбарт хүчин төгөлдөр болсон имэйл хаяг хэрэгтэй.";
$lang['valid_emails']		= "Энэ %s талбарт хүчин төгөлдөр болсон бүгд имэйл хаягнууд хэрэгтэй.";
$lang['valid_url']			= "Энэ %s талбарт хүчин төгөлдөр болсон URL хэрэгтэй.";
$lang['valid_ip']			= "Энэ %s талбарт заавал хүчин төгөлдөр болсон IP хэрэгтэй.";
$lang['min_length']			= "Энэ %s талбар нь хамгийн багадаа %s тэмдэгтийн урттай байх ёстой.";
$lang['max_length']			= "Энэ %s талбар нь уртаараа %s тэмдэгтээс хэтрэхгүй байх ёстой.";
$lang['exact_length']		= "Энэ %s талбар нь уртаараа яг %s тэмдэгтэй байх ёстой.";
$lang['alpha']				= "Энэ %s талбар нь зөвхөн цагаан толгойн тэмдэгтүүд агуулна.";
$lang['alpha_numeric']		= "Энэ %s талбар нь зөвхөн үсэг тоон тэмдэгтүүд агуулна.";
$lang['alpha_dash']			= "Энэ %s талбар нь зөвхөн үсэг тоон тэмдэгтүүд, доогуур зураасууд болон зураасууд агуулна.";
$lang['numeric']			= "Энэ %s талбар нь зөвхөн тоо агуулах ёстой.";
$lang['is_numeric']			= "Энэ %s талбар нь зөвхөн тоон тэмдэгтүүд агуулах ёстой.";
$lang['integer']			        = "Энэ %s талбар нь бүхэл тоог агуулах ёстой.";
$lang['regex_match']		= "Энэ %s талбар нь буруу форматтай байна.";
$lang['matches']			= "Энэ %s талбар нь %s талбартай таарахгүй байна.";
$lang['is_unique'] 			= "Энэ %s талбар нь онцгой утга агуулах ёстой.";
$lang['is_natural']			= "Энэ %s талбар нь зөвхөн эерэг тоог агуулах ёстой.";
$lang['is_natural_no_zero']	= "Энэ %s талбар нь тэгээс их тоог агуулах ёстой.";
$lang['decimal']			= "Энэ %s талбар нь аравтын тоог агуулах ёстой.";
$lang['less_than']			= "Энэ %s талбар нь %s-с бага тоо агуулсан байх ёстой.";
$lang['greater_than']		= "Энэ %s талбар нь %s-с их тоо агуулцан байх ёстой.";



/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */